import type { ICity, IPerson } from "../types";

export const persons: IPerson[] = [
    {
        name: "Алексеев Третьяк",
        post: "Жалованный толмач",
        city: "Казань",
        id: 1,
    },

    {
        name: "Григорьев Кадычик",
        post: "«толмач из Казани, послан к «государеве плавные службы»",
        city: "Казань",
        id: 2,
    },

    {
        name: "Давыдов Евдоким",
        post: "Толмач",
        city: "Казань",
        id: 3,
    },

    {
        name: "Ермолин Иванко",
        post: "Жалованный толмач",
        city: "Казань",
        id: 4,
    },

    {
        name: "Иванов Андрей сын Носов",
        post: "Толмач",
        city: "Казань",
        id: 5,
    },

    {
        name: "Иванов Кудаш",
        post: "жалованный толмач. Обладал пустошью Дертули (Дертулин) Апшеик (Апшеи) по Чувашской верхней дороге",
        city: "Казань",
        id: 6,
    },

    {
        name: "Иванов Андрей сын Носов",
        post: "Толмач",
        city: "Казань",
        id: 766,
    },

    {
        name: "Иванов Лучка",
        post: "Жалованный толмач",
        city: "Казань",
        id: 7,
    },

    {
        name: "Иванов Любим сын Носов",
        post: "Толмач",
        city: "Казань",
        id: 8,
    },

    {
        name: "Иванов Малец",
        post: "Жалованный толмач. Обладал пустошью Дертули (Дертулин) Апшеик (Апшеи) по Чувашской верхней дороге",
        city: "Казань",
        id: 9,
    },

    {
        name: "Иванов Федотка",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 10,
    },

    {
        name: "Ильин Якуш",
        post: "Толмач. Обладал земельными угодьями по Алацкой дороге в деревне Малая Мемер",
        city: "Казань",
        id: 11,
    },

    {
        name: "Исупка (Юсуп)",
        post: "Жалованный толмач",
        city: "Казань",
        id: 12,
    },

    {
        name: "Карп",
        post: "Толмач",
        city: "Казань",
        id: 13,
    },

    {
        name: "Кондратьев Первушка",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 14,
    },

    {
        name: "Кононов Первушка",
        post: "Жалованный толмач",
        city: "Казань",
        id: 15,
    },

    {
        name: "Конышев Четвертко (Четвертак)",
        post: "Жалованный толмач. Обладал поместьем (100 четей) в деревне Киндере",
        city: "Казань",
        id: 16,
    },

    {
        name: "Корман Молодой",
        post: "Толмач",
        city: "Казань",
        id: 17,
    },

    {
        name: "Кузьма",
        post: "Казанский толмач (см. Леонтьев сын Кузьма)",
        city: "Казань",
        id: 18,
    },

    {
        name: "Леонтьев сын Кузьма",
        post: "Толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 19,
    },

    {
        name: "Ломачев (Толмачев) Илья Сидоров сын",
        post: "Жалованный толмач",
        city: "Казань",
        id: 20,
    },

    {
        name: "Лучка (Лука)",
        post: "Жалованный толмач",
        city: "Казань",
        id: 21,
    },

    {
        name: "Малов Иван",
        post: "Толмач",
        city: "Казань",
        id: 22,
    },

    {
        name: "Микитин Ивашка",
        post: "Толмач",
        city: "Казань",
        id: 23,
    },

    {
        name: "Овсяников Андрей Иванов сын",
        post: "Толмач",
        city: "Казань",
        id: 24,
    },

    {
        name: "Овсяников Иванко",
        post: "Жалованный толмач",
        city: "Казань",
        id: 25,
    },

    {
        name: "Овсяников Куземка",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 26,
    },

    {
        name: "Овсяников Леонтий",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 27,
    },

    {
        name: "Овсяников Никитка",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 28,
    },

    {
        name: "Овсяников Ондрюшка",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 29,
    },

    {
        name: "Олешка",
        post: "Жалованный толмач",
        city: "Казань",
        id: 30,
    },

    {
        name: "Петров Карпик",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 31,
    },

    {
        name: "Петров Чобар",
        post: "Толмач",
        city: "Казань",
        id: 32,
    },

    {
        name: "Петров Чюрбак (Чюбарк)",
        post: "Жалованный толмач. Обладал земельными угодьями по Алацкой дороге в деревне Малая Мемер",
        city: "Казань",
        id: 33,
    },

    {
        name: "Пилников Третьячко",
        post: "Жалованный толмач. Обладал земельными угодьями по Алацкой дороге в деревне Малая Мемер",
        city: "Казань",
        id: 34,
    },

    {
        name: "Полуектов Тимошка",
        post: "Казанский толмач (переводил с «черемисского» (марийского) языка)",
        city: "Казань",
        id: 35,
    },

    {
        name: "Полуектов Архип",
        post: "Толмач (переводил с «черемисского» (марийского) языка)",
        city: "Казань",
        id: 36,
    },

    {
        name: "Полуектов Федор",
        post: "Толмач",
        city: "Казань",
        id: 37,
    },

    {
        name: "Посников (Постников) Федор",
        post: "Толмач в Казани. Посылался в Ногаи для переговоров с мурзами, награжден сукном за службу",
        city: "Казань",
        id: 38,
    },

    {
        name: "Постников Костька",
        post: "Толмач",
        city: "Казань",
        id: 39,
    },

    {
        name: "Родионов Васька",
        post: "Отставленный толмач",
        city: "Казань",
        id: 40,
    },

    {
        name: "Сидоров Илейка",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 41,
    },

    {
        name: "Сидоров Олешка",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 42,
    },

    {
        name: "Степанов Степан",
        post: "Толмач (переводил с вотяцкого (удмуртского) языка)",
        city: "Казань",
        id: 43,
    },

    {
        name: "Тансарин Петр",
        post: "Отставленный толмач",
        city: "Казань",
        id: 44,
    },

    {
        name: "Тимофеев Первушка",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 45,
    },

    {
        name: "Третьяк",
        post: "Толмач (см. Алексеев Третьяк)",
        city: "Казань",
        id: 46,
    },

    {
        name: "Третьяк (Троак)",
        post: "Толмач, новокрещен",
        city: "Казань",
        id: 47,
    },

    {
        name: "Тютчев Алексей",
        post: "Толмач",
        city: "Казань",
        id: 48,
    },

    {
        name: "Тютчев Артемий Семенов сын",
        post: "Толмач",
        city: "Казань",
        id: 49,
    },

    {
        name: "Федоров Тимоха",
        post: "Жалованный толмач. По Алацкой дороге обладал земельными угодьями в деревне Сеитляр на р. Суле",
        city: "Казань",
        id: 50,
    },

    {
        name: "Абразанов (Абрезаков, Абдразаков) Селей (Ишкалейка, Икшалей, Ших-Салей)",
        post: "Астраханский переводчик «фарсовских дел»",
        city: "Астрахань",
        id: 51,
    },

    {
        name: "Аджиминятов Барямка",
        post: "Переводчик в Терках",
        city: "Астрахань",
        id: 52,
    },

    {
        name: "Аксенов (Оксенов) Дмитрий (Митька)",
        post: "Толмач астраханской съезжей избы",
        city: "Астрахань",
        id: 53,
    },

    {
        name: "Алексеев Федор (Фаддей ?)",
        post: "Толмач астраханской съезжей избы; направлялся к калмыцким и ногайским тайшам",
        city: "Астрахань",
        id: 54,
    },

    {
        name: "Андреев Клементий",
        post: "Толмач астраханской съезжей избы",
        city: "Астрахань",
        id: 55,
    },

    {
        name: "Антонов Федор",
        post: "Толмач астраханской съезжей избы",
        city: "Астрахань",
        id: 56,
    },

    {
        name: "Аристов Прокофий",
        post: "Стрелецкий пятидесятник; выполнял функции толмача при посольстве",
        city: "Астрахань",
        id: 57,
    },

    {
        name: "Артемьев Иван",
        post: "Толмач черноярской приказной избы",
        city: "Астрахань",
        id: 58,
    },

    {
        name: "Артемьев Кузьма",
        post: "Толмач астраханской съезжей избы",
        city: "Астрахань",
        id: 59,
    },

    {
        name: "Асанов Гришка",
        post: "Толмач; отправлен в Москву с ногайскими послами",
        city: "Астрахань",
        id: 60,
    },

    {
        name: "Афанасьев Федор (Фома?)",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 61,
    },

    {
        name: "Афанасьев Фома",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 62,
    },

    {
        name: "Ашеров (Ашеронов) Байтюбек",
        post: "Переводчик астраханской приказной палаты",
        city: "Астрахань",
        id: 63,
    },

    {
        name: "Бобров Андрей",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 64,
    },

    {
        name: "Борисов Афанасий",
        post: "Толмач астраханской съезжей избы; участвовал в ногайских посылках",
        city: "Астрахань",
        id: 65,
    },

    {
        name: "Брюшков Богдан",
        post: "Астраханский переводчик и толмач; сопровождал посольства",
        city: "Астрахань",
        id: 66,
    },

    {
        name: "Васильев Дмитрий",
        post: "Толмач; прибыл из Тарков в Терский город",
        city: "Астрахань",
        id: 67,
    },

    {
        name: "Васильев Михаил",
        post: "Толмач астраханской съезжей избы",
        city: "Астрахань",
        id: 68,
    },

    {
        name: "Васильев Степан",
        post: "Толмач астраханской приказной палаты; направлялся в калмыцкие улусы",
        city: "Астрахань",
        id: 69,
    },

    {
        name: "Волошинов (Волошенин, Воложенин) Степан Родионов",
        post: "Толмач астраханской приказной палаты; ранее черноярский толмач",
        city: "Астрахань",
        id: 70,
    },

    {
        name: "Вражский (Вразский, Врасский, Враский) Прокофий Иванов сын",
        post: "Астраханский переводчик; позднее служил в Посольском приказе",
        city: "Астрахань",
        id: 71,
    },

    {
        name: "Галактионов Иван",
        post: "Толмач в Терках; погиб при возвращении из посольства",
        city: "Астрахань",
        id: 72,
    },

    {
        name: "Герасимов Алексей",
        post: "Толмач астраханской приказной палаты; направлялся в военные и дипломатические миссии",
        city: "Астрахань",
        id: 73,
    },

    {
        name: "Герасимов Михаил",
        post: "Толмач астраханской приказной палаты; участвовал в ногайских и калмыцких посылках",
        city: "Астрахань",
        id: 74,
    },

    {
        name: "Гирмас (?) Андрей",
        post: "Толмач астраханской съезжей избы; посылался в Ногаи",
        city: "Астрахань",
        id: 75,
    },

    {
        name: "Григорьев Давыд",
        post: "Терский толмач; сопровождал посланца имеретинского царя",
        city: "Астрахань",
        id: 76,
    },

    {
        name: "Григорьев Иван",
        post: "Толмач астраханской приказной палаты; калмыцкая посылка",
        city: "Астрахань",
        id: 77,
    },

    {
        name: "Григорьев Кадычик",
        post: "Толмач из Казани; направлен на государевы службы",
        city: "Астрахань",
        id: 78,
    },

    {
        name: "Грузинцев Алексей",
        post: "Толмач астраханской приказной палаты; посылался в Терки",
        city: "Астрахань",
        id: 79,
    },

    {
        name: "Данилов Русин",
        post: "Стрелецкий сотник и толмач; участвовал в посольствах в Грузию",
        city: "Астрахань",
        id: 80,
    },

    {
        name: "Девлет-абыз (Абыз, Девлет абыз Меликов (?), Девлет абыз Аббасов, Девлет Мамет)",
        post: "Астраханский переводчик; владел татарским, персидским и арабским языками",
        city: "Астрахань",
        id: 81,
    },

    {
        name: "Дмитриев Григорий",
        post: "Астраханский толмач; посылался в Ногаи",
        city: "Астрахань",
        id: 82,
    },

    {
        name: "Дмитриев Ефим",
        post: "Толмач астраханской приказной палаты; посылался в Терки",
        city: "Астрахань",
        id: 83,
    },

    {
        name: "Егорьев Максим",
        post: "Переводчик; сопровождал грузинского царя Арчила",
        city: "Астрахань",
        id: 84,
    },

    {
        name: "Елизарьев Ян (Яков)",
        post: "Астраханский толмач; посылался в Ногаи",
        city: "Астрахань",
        id: 85,
    },

    {
        name: "Елисеев Алексей",
        post: "Астраханский переводчик «калмыцких писем» и толмач",
        city: "Астрахань",
        id: 86,
    },

    {
        name: "Ерофеев Михаил",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 87,
    },

    {
        name: "Зверев Полуэкт",
        post: "Толмач",
        city: "Астрахань",
        id: 88,
    },

    {
        name: "Земанов (Заманов, Займанов, Замонов) Мамат-Агей (Мамет-Агей, Маматагей)",
        post: "Переводчик персидского языка астраханской приказной палаты",
        city: "Астрахань",
        id: 89,
    },

    {
        name: "Зиновьев",
        post: "Астраханский толмач; посылался в Малую Ногайскую Орду",
        city: "Астрахань",
        id: 90,
    },
    {
        name: "Иванисов Сафар",
        post: "Астраханский толмач; владел фарси, турецким и армянским языками",
        city: "Астрахань",
        id: 91,
    },

    {
        name: "Иванов (Черемисчен) Янка",
        post: "Астраханский юртовский толмач",
        city: "Астрахань",
        id: 92,
    },

    {
        name: "Иванов Афанасий",
        post: "Астраханский посадский человек; выполнял функции толмача в Персии",
        city: "Астрахань",
        id: 93,
    },

    {
        name: "Иванов Василий",
        post: "Толмач астраханской приказной палаты; посылался в Тарки",
        city: "Астрахань",
        id: 94,
    },

    {
        name: "Иванов Василий (новокрещен)",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 95,
    },

    {
        name: "Иванов Григорий",
        post: "Астраханский «калмыцкий» толмач",
        city: "Астрахань",
        id: 96,
    },

    {
        name: "Иванов Елисей",
        post: "Астраханский толмач; посылался в Москву с купцами",
        city: "Астрахань",
        id: 97,
    },

    {
        name: "Иванов Ивашка",
        post: "Астраханский толмач; посылался в Ногаи",
        city: "Астрахань",
        id: 98,
    },

    {
        name: "Иванов Федор",
        post: "Переводчик калмыцких писем астраханской приказной палаты",
        city: "Астрахань",
        id: 99,
    },

    {
        name: "Казанец Иван",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 100,
    },

    {
        name: "Карагашев Логин",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 101,
    },

    {
        name: "Кирсанко",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 102,
    },

    {
        name: "Клутемс Эткласен (?)",
        post: "Переводчик; вероятно связан с иностранным посольством в Астрахани",
        city: "Астрахань",
        id: 103,
    },

    {
        name: "Козлов Кузьма",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 104,
    },

    {
        name: "Кучумов Тимофей (Тихон?)",
        post: "Толмач терской приказной избы",
        city: "Астрахань",
        id: 105,
    },

    {
        name: "Ларионов Василий",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 106,
    },

    {
        name: "Лекорт (Лакурт, Лякуртов, Лякурн, Лякурт) Петр",
        post: "Переводчик",
        city: "Астрахань",
        id: 107,
    },

    {
        name: "Леонтьев Ермолай",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 108,
    },

    {
        name: "Локтев Ермак (Ермачка)",
        post: "Астраханский толмач; посылался в Ногаи",
        city: "Астрахань",
        id: 109,
    },
    {
        name: "Магаметев Мамасалей",
        post: "Астраханский «переводчик татарских дел»",
        city: "Астрахань",
        id: 86,
    },
    {
        name: "Макарьев Алексей",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 87,
    },
    {
        name: "Максимов Иван",
        post: "Астраханский толмач приказной палаты",
        city: "Астрахань",
        id: 88,
    },
    {
        name: "Максимов Иван",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 89,
    },
    {
        name: "Малафеев Григорий",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 90,
    },
    {
        name: "Мартынов Алексей",
        post: "Толмач (при князе Хеты мурзе Черкасском)",
        city: "Астрахань",
        id: 91,
    },
    {
        name: "Медведев Никита",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 92,
    },
    {
        name: "Михайлов Василий",
        post: "Толмач астраханской съезжей избы",
        city: "Астрахань",
        id: 93,
    },
    {
        name: "Михайлов Герасим",
        post: "Толмач астраханской съезжей избы",
        city: "Астрахань",
        id: 94,
    },
    {
        name: "Михайлов Иван",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 95,
    },
    {
        name: "Михайлов Иван",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 96,
    },
    {
        name: "Михайлов Остафий",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 97,
    },
    {
        name: "Мокеев Афонька",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 98,
    },
    {
        name: "Мокеев Иван",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 99,
    },
    {
        name: "Мулин Ядычка",
        post: "Переводчик астраханской приказной палаты",
        city: "Астрахань",
        id: 100,
    },
    {
        name: "Муромцев Ефим",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 101,
    },
    {
        name: "Никитин Любим",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 102,
    },
    {
        name: "Никитин Степан",
        post: "Толмач астраханской съезжей избы",
        city: "Астрахань",
        id: 103,
    },
    {
        name: "Новокрещенов Иван Иванов",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 104,
    },
    {
        name: "Орженников Осип Андреев сын",
        post: "Толмач",
        city: "Астрахань",
        id: 105,
    },
    {
        name: "Пахомов Степан",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 106,
    },
    {
        name: "Полуехтов Русинка",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 107,
    },
    {
        name: "Пушкарев Федька",
        post: "Толмач (астраханский?)",
        city: "Астрахань",
        id: 108,
    },
    {
        name: "Романов Иван",
        post: "Толмач приказной палаты",
        city: "Астрахань",
        id: 109,
    },
    {
        name: "Рохмистров Яков Иванович",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 110,
    },
    {
        name: "Савельев Ян",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 111,
    },
    {
        name: "Сафонов Андрей",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 112,
    },
    {
        name: "Семенов Михаил",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 113,
    },
    {
        name: "Степанов Кирилл",
        post: "Черноярский толмач",
        city: "Астрахань",
        id: 114,
    },
    {
        name: "Татаринов Василий",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 115,
    },
    {
        name: "Тварогов Иван",
        post: "Терский толмач",
        city: "Астрахань",
        id: 116,
    },
    {
        name: "Тимофеев Андрей",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 117,
    },
    {
        name: "Тимофеев Лука",
        post: "Толмач астраханской съезжей избы / приказной палаты",
        city: "Астрахань",
        id: 118,
    },
    {
        name: "Тимофеев Семен",
        post: "Терский толмач",
        city: "Астрахань",
        id: 119,
    },
    {
        name: "Трофимов Семен",
        post: "Терский толмач",
        city: "Астрахань",
        id: 120,
    },
    {
        name: "Тырков Иван",
        post: "Переводчик",
        city: "Астрахань",
        id: 121,
    },
    {
        name: "Ульянов Петр",
        post: "Толмач терской приказной избы",
        city: "Астрахань",
        id: 122,
    },
    {
        name: "Федоров Евдоким",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 123,
    },
    {
        name: "Федоров Кирилл",
        post: "Терский переводчик",
        city: "Астрахань",
        id: 124,
    },
    {
        name: "Федоров Юшка",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 125,
    },
    {
        name: "Фролов Афанасий",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 126,
    },
    {
        name: "Челпка Никита Юрьев сын",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 127,
    },
    {
        name: "Шадрин Сила",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 128,
    },
    {
        name: "Яков",
        post: "Астраханский толмач",
        city: "Астрахань",
        id: 129,
    },
    {
        name: "Яренцев Е.Д.",
        post: "Толмач астраханской приказной палаты",
        city: "Астрахань",
        id: 130,
    },
];

export const cities: ICity[] = [
    {
        latin_name: "Kazan",
        title: "Казань",
        population: 1200,
        xCoor: 49,
        yCoor: 55.5,
        id: 3,
    },

    {
        latin_name: "Astrakhan",
        title: "Астрахань",
        population: 1200,
        xCoor: 46.2,
        yCoor: 48,
        id: 4,
    },
];
